###############################################################################
# Clock
###############################################################################

create_clock \
    -name clk \
    -period 10.0 \
    [get_ports clock]

###############################################################################
# Clock uncertainty
###############################################################################

set_clock_uncertainty 0.10 [get_clocks clk]

###############################################################################
# Input delays
###############################################################################

set_input_delay 2.0 \
    -clock clk \
    [get_ports {reset i_init i_inc_dec}]

###############################################################################
# Output delays
###############################################################################

set_output_delay 2.0 \
    -clock clk \
    [get_ports {o_value[*]}]

###############################################################################
# Output load
###############################################################################

set_load 0.010 \
    [get_ports {o_value[*]}]

###############################################################################
# False path
###############################################################################

set_false_path \
    -from [get_ports reset]