################################################################################
# Setup
################################################################################

source setup.tcl

################################################################################
# Read RTL
################################################################################

analyze \
    -format vhdl \
    ../rtl/counter.vhdl \
    -library WORK

################################################################################
# Elaborate
################################################################################

elaborate counter

set_top_module counter

################################################################################
# Constraints
################################################################################

read_sdc ../constraints/counter.sdc

################################################################################
# Compile
################################################################################

compile_logical

################################################################################
# Reports
################################################################################

report_qor

report_area

report_timing

################################################################################
# Outputs
################################################################################

write_verilog -hierarchy -output counter_netlist.v

write_sdc counter.sdc